import telebot

TOKEN = 'код бота'
bot = telebot.TeleBot(TOKEN)

# Ваш список городов,можете добавить любой
cities = ["Абу-Даби", "Аддис-Абеба", "Алжир", "Амман", "Амстердам", "Анкара", "Антигуа",
    "Апиа", "Ашхабад", "Афины", "Багдад", "Баку", "Бамако", "Банги", "Бангкок",
    "Банжул", "Бейрут", "Белград", "Белмопан", "Берлин", "Берн", "Бишкек",
    "Бразилиа", "Братислава", "Бриджтаун", "Брюссель", "Бухарест", "Будапешт",
    "Бухенвальд", "Буэнос-Айрес", "Вадуц", "Валлетта", "Варшава", "Ватикан",
    "Веллингтон", "Вена", "Виктория", "Вильнюс", "Виндхук", "Вьентьян",
    "Габороне", "Гаити", "Гавана", "Гейдельберг", "Гонконг", "Гранада",
    "Гуатемала", "Дакка", "Дамаск", "Джакарта", "Джорджтаун", "Джуба",
    "Додома", "Доха", "Дублин", "Душанбе", "Ереван", "Загреб", "Иерусалим",
    "Исламабад", "Кабул", "Каир", "Кампала", "Канберра", "Каракас",
    "Кастри", "Киев", "Кигали", "Кингстаун", "Кингстон", "Киншаса",
    "Кито", "Коломбо", "Конакри", "Копенгаген", "Либревиль", "Лилонгве",
    "Лима", "Лиссабон", "Ломе", "Лондон", "Луанда", "Лусака", "Любляна",
    "Люксембург", "Маджуро", "Мадрид", "Малабо", "Мале", "Манагуа", "Манама",
    "Манила", "Мапуту", "Масеру", "Маскат", "Мбабане", "Мехико", "Минск",
    "Могадишо", "Монако", "Монровия", "Монтевидео", "Морони", "Москва",
    "Найроби", "Нассау", "Нджамена", "Нейпьидо", "Никосия", "Нуакшот", "Нукуалофа",
    "Нью-Дели", "Осло", "Оттава", "Паликир", "Панама", "Парамарибо", "Париж",
    "Пекин", "Пномпень", "Подгорица", "Порт-Вила", "Порт-ау-Пренс", "Порт-Луи",
    "Порт-Морсби", "Порт-оф-Спейн", "Порто-Ново", "Прага", "Прая", "Пхеньян",
    "Рабат", "Рейкьявик", "Рига", "Рим", "Розо", "Сан-Марино", "Сан-Сальвадор",
    "Сана", "Санта-Фе-де-Богота", "Санто-Доминго", "Сантьяго", "Сараево",
    "Сент-Джонс", "Сент-Джорджес", "Сеул", "Сингапур", "Скопье",
    "София", "Стокгольм", "Сукре", "Сува", "Тайбэй", "Таллин", "Ташкент",
    "Тбилиси", "Тегусигальпа", "Тегеран", "Тирана", "Токио", "Триполи",
    "Тхимпху", "Тунис", "Тхуне", "Уагадугу", "Улан-Батор", "Фритаун",
    "Ханой", "Хараре", "Хельсинки", "Хониара", "Черногория", "Эль-Кувейт",
    "Эдмонтон", "Эр-Рияд", "Ямусукро", "Яунде"
]


used_cities = []


# Объединяем обработчик для команд start и restart
@bot.message_handler(commands=['start', 'restart'])
def send_welcome(message):
    used_cities.clear()  # Очищаем список использованных городов
    reply = 'Привет! Давай сыграем в игру "Города". Начни ты!' if message.text == '/start' else 'Начинаем заново! Твой ход!'
    bot.send_message(message.chat.id, reply)


def find_city(last_char, used_cities):
    for city in cities:
        if city.lower().startswith(last_char.lower()) and city not in used_cities:
            return city
    return None


@bot.message_handler(func=lambda message: True)
def city(message):
    user_city = message.text.strip().capitalize()

    # Ищем город на последнюю букву последнего использованного города
    if used_cities and not user_city.lower().startswith(used_cities[-1][-1].lower()):
        bot.send_message(message.chat.id,
                         f"Город должен начинаться на букву '{used_cities[-1][-1]}'. Попробуй ещё раз.")
        return

    if user_city in used_cities or user_city not in cities:
        bot.send_message(message.chat.id, "Не знаю такого города или он уже был. Попробуй назвать другой.")
        return

    # Добавляем город, названный пользователем, в список использованных
    used_cities.append(user_city)

    last_char = user_city[-1]
    if last_char.lower() in 'ъьы':
        last_char = user_city[-2]

    next_city = find_city(last_char, used_cities)

    if next_city:
        used_cities.append(next_city)
        bot.send_message(message.chat.id, next_city)
    else:
        bot.send_message(message.chat.id,
                         "Я не могу найти город на эту букву, ты выиграл! Напиши /restart чтобы сыграть ещё раз.")


bot.polling(none_stop=True)
